"Sender: wmitchell@hefestis.ac.ukDate sent: Oct 28, 2022 1:57 PMTo: \"service.management@ed.ac.uk\" <service.management@ed.ac.uk>CC: Hazel Martinson <hmartinson@hefestis.ac.uk>Subject: New UniDesk member - Quick Calls planned workThis email was sent to you by someone outside the University.  You should only click on links or attachments if you are certain that the email is genuine and the content is safe.Hey gang,UoE controls the underlying mechanism for adding new institutions to Quick Calls. We have a new member joining who are prospectively going live on 8th December. I wil need Dev/Production Management to facilitate adding a new object in for Quick Calls to the existing QC infrastructure. The DNS entry for the domain has not been completed yet and we are awaiting the creation of the environment by TOPdesk. I’d just like to secure a booking with you for the Quick Calls entry and would like an indication of your availability over the next few weeks to complete this work please. The IdP will be setup next week at the new member so I’d say that a booking from W/C 7th November onwards would be sensible. HEFESTIS is arranging the ongoing support of Quick Calls with Stefan directly to ensure that we can receive support or planned work arrangements – I’d advise speaking to him for any queries on ASTA coding/approval.Kind RegardsWillieWillie Mitchell - Service Operations ManagerE:  wmitchell@hefestis.ac.ukhefestis.ac.ukHigher Education/Further Education Shared Technology and Information ServicesStirling Business Centre, Wellgreen, Stirling, FK8 2DZHEFESTIS Ltd is co-owned by member institutions across the Scottish University and Colleges sectors, Incorporated in Scotland SC603511CONFIDENTIALITY NOTICEThis email is intended only for the addressee named above. As this email may contain confidential or privileged information, if you are not the named addressee or the person responsible for delivering the message to the named addressee, please telephone us immediately on 0131 442 8930. The contents should not be disclosed to any other person nor copies taken. We do not accept any liability or responsibility for: (1) changes made to this email after it was sent, or (2) viruses transmitted through this email or any attachment."